var AV = require('leanengine');

var unirest = require("unirest");
var Promise = require('promise');

var coordtransform = require('coordtransform');

var _ = require("underscore");

function getProvince(lat, lon) {
    return new Promise(function (fulfill, reject) {
        var req = unirest("GET", "http://api.map.baidu.com/cloudrgc/v1?location=" + lat + "," + lon);
        var location = lat + "," + lon;
        req.query({
            "geotable_id": "1",
            "coord_type": "bd09ll",
            "ak": "VKxmPFuviR4uzakcK5ZW5GXAxeAfIbsK"
        });
        req.end(function (res) {
            if (res.error) {
                reject(res.error);
            } else {
                if (res.body && res.body.status == 0) {
                    fulfill(res.body.address_component.province);
                } else {
                    reject(res.body);
                }
            }
        });
    })
}

//var VALID_PROVINCES = {
//    '广东省': {
//        start:{start_hour: 6, start_min: 18},
//        end:{end_hour: 18, end_min: 14},
//        dayRiskRate: 0.65,
//        nightRiskRate: 0.8361,
//        diseaseRate: 0.000424549,
//        insects: {
//            12: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.9497,"白纹伊蚊":0.0118,"三带喙库蚊":0.0353,"中华按蚊":0.0032,"致倦库蚊":0.9497},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.9439,"白纹伊蚊":0.06,"三带喙库蚊":0.03,"中华按蚊":0,"致倦库蚊":0.9439}
//            },
//            1: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.9497,"白纹伊蚊":0.0118,"三带喙库蚊":0.0353,"中华按蚊":0.0032,"致倦库蚊":0.9497},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.9439,"白纹伊蚊":0.06,"三带喙库蚊":0.03,"中华按蚊":0,"致倦库蚊":0.9439}
//            },
//            2: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.9497,"白纹伊蚊":0.0118,"三带喙库蚊":0.0353,"中华按蚊":0.0032,"致倦库蚊":0.9497},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.9439,"白纹伊蚊":0.06,"三带喙库蚊":0.03,"中华按蚊":0,"致倦库蚊":0.9439}
//            },
//            3: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.721,"白纹伊蚊":0.0488,"三带喙库蚊":0.222,"中华按蚊":0.008,"致倦库蚊":0.721},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.7899,"白纹伊蚊":0.0266,"三带喙库蚊":0.1833,"中华按蚊":0,"致倦库蚊":0.7899}
//            },
//            4: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.721,"白纹伊蚊":0.0488,"三带喙库蚊":0.222,"中华按蚊":0.008,"致倦库蚊":0.721},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.7899,"白纹伊蚊":0.0266,"三带喙库蚊":0.1833,"中华按蚊":0,"致倦库蚊":0.7899}
//            },
//            5: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.721,"白纹伊蚊":0.0488,"三带喙库蚊":0.222,"中华按蚊":0.008,"致倦库蚊":0.721},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.7899,"白纹伊蚊":0.0266,"三带喙库蚊":0.1833,"中华按蚊":0,"致倦库蚊":0.7899}
//            },
//            6: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.8361,"白纹伊蚊":0.1133,"三带喙库蚊":0.0341,"中华按蚊":0.0164,"致倦库蚊":0.8361},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.8831,"白纹伊蚊":0.0883,"三带喙库蚊":0.0213,"中华按蚊":0.0073,"致倦库蚊":0.8831}
//            },
//            7: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.8361,"白纹伊蚊":0.1133,"三带喙库蚊":0.0341,"中华按蚊":0.0164,"致倦库蚊":0.8361},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.8831,"白纹伊蚊":0.0883,"三带喙库蚊":0.0213,"中华按蚊":0.0073,"致倦库蚊":0.8831}
//            },
//            8: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.8361,"白纹伊蚊":0.1133,"三带喙库蚊":0.0341,"中华按蚊":0.0164,"致倦库蚊":0.8361},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.8831,"白纹伊蚊":0.0883,"三带喙库蚊":0.0213,"中华按蚊":0.0073,"致倦库蚊":0.8831}
//            },
//            9: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.8361,"白纹伊蚊":0.1133,"三带喙库蚊":0.0341,"中华按蚊":0.0164,"致倦库蚊":0.8361},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.8831,"白纹伊蚊":0.0883,"三带喙库蚊":0.0213,"中华按蚊":0.0073,"致倦库蚊":0.8831}
//            },
//            10: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.8361,"白纹伊蚊":0.1133,"三带喙库蚊":0.0341,"中华按蚊":0.0164,"致倦库蚊":0.8361},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.8831,"白纹伊蚊":0.0883,"三带喙库蚊":0.0213,"中华按蚊":0.0073,"致倦库蚊":0.8831}
//            },
//            11: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.8361,"白纹伊蚊":0.1133,"三带喙库蚊":0.0341,"中华按蚊":0.0164,"致倦库蚊":0.8361},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.8831,"白纹伊蚊":0.0883,"三带喙库蚊":0.0213,"中华按蚊":0.0073,"致倦库蚊":0.8831}
//            },
//        }
//    },
//    '云南省': {
//        start:{start_hour: 7, start_min: 1},
//        end:{end_hour: 18, end_min: 56},
//        dayRiskRate: 0.7,
//        nightRiskRate: 0.65,
//        diseaseRate: 0.000009474,
//        insects: {
//            12: {
//                city_day: {"单色库蚊":0.01,"白纹伊蚊":0.6,"三带喙库蚊":0.01,"中华按蚊":0,"致倦库蚊":0.01},
//                city_night: {"单色库蚊":0.2,"白纹伊蚊":0.01,"三带喙库蚊":0.6,"中华按蚊":0.005,"致倦库蚊":0.2},
//                rural_day: {"单色库蚊":0.01,"白纹伊蚊":0.65,"三带喙库蚊":0.01,"中华按蚊":0,"致倦库蚊":0.01},
//                rural_night: {"单色库蚊":0.1,"白纹伊蚊":0.01,"三带喙库蚊":0.6,"中华按蚊":0.01,"致倦库蚊":0.1}
//            },
//            1: {
//                city_day: {"单色库蚊":0.01,"白纹伊蚊":0.6,"三带喙库蚊":0.01,"中华按蚊":0,"致倦库蚊":0.01},
//                city_night: {"单色库蚊":0.2,"白纹伊蚊":0.01,"三带喙库蚊":0.6,"中华按蚊":0.005,"致倦库蚊":0.2},
//                rural_day: {"单色库蚊":0.01,"白纹伊蚊":0.65,"三带喙库蚊":0.01,"中华按蚊":0,"致倦库蚊":0.01},
//                rural_night: {"单色库蚊":0.1,"白纹伊蚊":0.01,"三带喙库蚊":0.6,"中华按蚊":0.01,"致倦库蚊":0.1}
//            },
//            2: {
//                city_day: {"单色库蚊":0.01,"白纹伊蚊":0.6,"三带喙库蚊":0.01,"中华按蚊":0,"致倦库蚊":0.01},
//                city_night: {"单色库蚊":0.2,"白纹伊蚊":0.01,"三带喙库蚊":0.6,"中华按蚊":0.005,"致倦库蚊":0.2},
//                rural_day: {"单色库蚊":0.01,"白纹伊蚊":0.65,"三带喙库蚊":0.01,"中华按蚊":0,"致倦库蚊":0.01},
//                rural_night: {"单色库蚊":0.1,"白纹伊蚊":0.01,"三带喙库蚊":0.6,"中华按蚊":0.01,"致倦库蚊":0.1}
//            },
//            3: {
//                city_day: {"单色库蚊":0.01,"白纹伊蚊":0.6,"三带喙库蚊":0.01,"中华按蚊":0.005,"致倦库蚊":0.01},
//                city_night: {"单色库蚊":0.2,"白纹伊蚊":0.05,"三带喙库蚊":0.6,"中华按蚊":0.05,"致倦库蚊":0.2},
//                rural_day: {"单色库蚊":0.05,"白纹伊蚊":0.65,"三带喙库蚊":0.02,"中华按蚊":0.01,"致倦库蚊":0.05},
//                rural_night: {"单色库蚊":0.2,"白纹伊蚊":0.05,"三带喙库蚊":0.7,"中华按蚊":0.1,"致倦库蚊":0.2}
//            },
//            4: {
//                city_day: {"单色库蚊":0.01,"白纹伊蚊":0.6,"三带喙库蚊":0.01,"中华按蚊":0.005,"致倦库蚊":0.01},
//                city_night: {"单色库蚊":0.2,"白纹伊蚊":0.05,"三带喙库蚊":0.6,"中华按蚊":0.05,"致倦库蚊":0.2},
//                rural_day: {"单色库蚊":0.05,"白纹伊蚊":0.65,"三带喙库蚊":0.02,"中华按蚊":0.01,"致倦库蚊":0.05},
//                rural_night: {"单色库蚊":0.2,"白纹伊蚊":0.05,"三带喙库蚊":0.7,"中华按蚊":0.1,"致倦库蚊":0.2}
//            },
//            5: {
//                city_day: {"单色库蚊":0.01,"白纹伊蚊":0.6,"三带喙库蚊":0.01,"中华按蚊":0.005,"致倦库蚊":0.01},
//                city_night: {"单色库蚊":0.2,"白纹伊蚊":0.05,"三带喙库蚊":0.6,"中华按蚊":0.05,"致倦库蚊":0.2},
//                rural_day: {"单色库蚊":0.05,"白纹伊蚊":0.65,"三带喙库蚊":0.02,"中华按蚊":0.01,"致倦库蚊":0.05},
//                rural_night: {"单色库蚊":0.2,"白纹伊蚊":0.05,"三带喙库蚊":0.7,"中华按蚊":0.1,"致倦库蚊":0.2}
//            },
//            6: {
//                city_day: {"单色库蚊":0.05,"白纹伊蚊":0.7,"三带喙库蚊":0.03,"中华按蚊":0.005,"致倦库蚊":0.05},
//                city_night: {"单色库蚊":0.25,"白纹伊蚊":0.05,"三带喙库蚊":0.65,"中华按蚊":0.1,"致倦库蚊":0.25},
//                rural_day: {"单色库蚊":0.05,"白纹伊蚊":0.75,"三带喙库蚊":0.04,"中华按蚊":0.01,"致倦库蚊":0.05},
//                rural_night: {"单色库蚊":0.25,"白纹伊蚊":0.05,"三带喙库蚊":0.75,"中华按蚊":0.15,"致倦库蚊":0.25}
//            },
//            7: {
//                city_day: {"单色库蚊":0.05,"白纹伊蚊":0.7,"三带喙库蚊":0.03,"中华按蚊":0.005,"致倦库蚊":0.05},
//                city_night: {"单色库蚊":0.25,"白纹伊蚊":0.05,"三带喙库蚊":0.65,"中华按蚊":0.1,"致倦库蚊":0.25},
//                rural_day: {"单色库蚊":0.05,"白纹伊蚊":0.75,"三带喙库蚊":0.04,"中华按蚊":0.01,"致倦库蚊":0.05},
//                rural_night: {"单色库蚊":0.25,"白纹伊蚊":0.05,"三带喙库蚊":0.75,"中华按蚊":0.15,"致倦库蚊":0.25}
//            },
//            8: {
//                city_day: {"单色库蚊":0.05,"白纹伊蚊":0.7,"三带喙库蚊":0.03,"中华按蚊":0.005,"致倦库蚊":0.05},
//                city_night: {"单色库蚊":0.25,"白纹伊蚊":0.05,"三带喙库蚊":0.65,"中华按蚊":0.1,"致倦库蚊":0.25},
//                rural_day: {"单色库蚊":0.05,"白纹伊蚊":0.75,"三带喙库蚊":0.04,"中华按蚊":0.01,"致倦库蚊":0.05},
//                rural_night: {"单色库蚊":0.25,"白纹伊蚊":0.05,"三带喙库蚊":0.75,"中华按蚊":0.15,"致倦库蚊":0.25}
//            },
//            9: {
//                city_day: {"单色库蚊":0.05,"白纹伊蚊":0.7,"三带喙库蚊":0.03,"中华按蚊":0.005,"致倦库蚊":0.05},
//                city_night: {"单色库蚊":0.25,"白纹伊蚊":0.05,"三带喙库蚊":0.65,"中华按蚊":0.1,"致倦库蚊":0.25},
//                rural_day: {"单色库蚊":0.05,"白纹伊蚊":0.75,"三带喙库蚊":0.04,"中华按蚊":0.01,"致倦库蚊":0.05},
//                rural_night: {"单色库蚊":0.25,"白纹伊蚊":0.05,"三带喙库蚊":0.75,"中华按蚊":0.15,"致倦库蚊":0.25}
//            },
//            10: {
//                city_day: {"单色库蚊":0.05,"白纹伊蚊":0.7,"三带喙库蚊":0.03,"中华按蚊":0.005,"致倦库蚊":0.05},
//                city_night: {"单色库蚊":0.25,"白纹伊蚊":0.05,"三带喙库蚊":0.65,"中华按蚊":0.1,"致倦库蚊":0.25},
//                rural_day: {"单色库蚊":0.05,"白纹伊蚊":0.75,"三带喙库蚊":0.04,"中华按蚊":0.01,"致倦库蚊":0.05},
//                rural_night: {"单色库蚊":0.25,"白纹伊蚊":0.05,"三带喙库蚊":0.75,"中华按蚊":0.15,"致倦库蚊":0.25}
//            },
//            11: {
//                city_day: {"单色库蚊":0.05,"白纹伊蚊":0.7,"三带喙库蚊":0.03,"中华按蚊":0.005,"致倦库蚊":0.05},
//                city_night: {"单色库蚊":0.25,"白纹伊蚊":0.05,"三带喙库蚊":0.65,"中华按蚊":0.1,"致倦库蚊":0.25},
//                rural_day: {"单色库蚊":0.05,"白纹伊蚊":0.75,"三带喙库蚊":0.04,"中华按蚊":0.01,"致倦库蚊":0.05},
//                rural_night: {"单色库蚊":0.25,"白纹伊蚊":0.05,"三带喙库蚊":0.75,"中华按蚊":0.15,"致倦库蚊":0.25}
//            }
//        }
//    },
//    '广西壮族自治区': {
//        start:{start_hour: 6, start_min: 47},
//        end:{end_hour: 18, end_min: 7},
//        dayRiskRate: 0.65,
//        nightRiskRate: 0.86,
//        diseaseRate: 0.000018097,
//        insects: {
//            12: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.86,"白纹伊蚊":0.1,"三带喙库蚊":0.03,"中华按蚊":0.005,"致倦库蚊":0.86},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.86,"白纹伊蚊":0.1,"三带喙库蚊":0.03,"中华按蚊":0.005,"致倦库蚊":0.86}
//            },
//            1: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.86,"白纹伊蚊":0.1,"三带喙库蚊":0.03,"中华按蚊":0.005,"致倦库蚊":0.86},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.86,"白纹伊蚊":0.1,"三带喙库蚊":0.03,"中华按蚊":0.005,"致倦库蚊":0.86}
//            },
//            2: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.86,"白纹伊蚊":0.1,"三带喙库蚊":0.03,"中华按蚊":0.005,"致倦库蚊":0.86},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.86,"白纹伊蚊":0.1,"三带喙库蚊":0.03,"中华按蚊":0.005,"致倦库蚊":0.86}
//            },
//            3: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.86,"白纹伊蚊":0.1,"三带喙库蚊":0.03,"中华按蚊":0.005,"致倦库蚊":0.86},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.86,"白纹伊蚊":0.1,"三带喙库蚊":0.03,"中华按蚊":0.005,"致倦库蚊":0.86}
//            },
//            4: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.86,"白纹伊蚊":0.1,"三带喙库蚊":0.03,"中华按蚊":0.005,"致倦库蚊":0.86},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.86,"白纹伊蚊":0.1,"三带喙库蚊":0.03,"中华按蚊":0.005,"致倦库蚊":0.86}
//            },
//            5: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.86,"白纹伊蚊":0.1,"三带喙库蚊":0.03,"中华按蚊":0.005,"致倦库蚊":0.86},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.86,"白纹伊蚊":0.1,"三带喙库蚊":0.03,"中华按蚊":0.005,"致倦库蚊":0.86}
//            },
//            6: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.86,"白纹伊蚊":0.1,"三带喙库蚊":0.03,"中华按蚊":0.005,"致倦库蚊":0.86},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.86,"白纹伊蚊":0.1,"三带喙库蚊":0.03,"中华按蚊":0.005,"致倦库蚊":0.86}
//            },
//            7: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.86,"白纹伊蚊":0.1,"三带喙库蚊":0.03,"中华按蚊":0.005,"致倦库蚊":0.86},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.86,"白纹伊蚊":0.1,"三带喙库蚊":0.03,"中华按蚊":0.005,"致倦库蚊":0.86}
//            },
//            8: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.86,"白纹伊蚊":0.1,"三带喙库蚊":0.03,"中华按蚊":0.005,"致倦库蚊":0.86},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.86,"白纹伊蚊":0.1,"三带喙库蚊":0.03,"中华按蚊":0.005,"致倦库蚊":0.86}
//            },
//            9: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.86,"白纹伊蚊":0.1,"三带喙库蚊":0.03,"中华按蚊":0.005,"致倦库蚊":0.86},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.86,"白纹伊蚊":0.1,"三带喙库蚊":0.03,"中华按蚊":0.005,"致倦库蚊":0.86}
//            },
//            10: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.86,"白纹伊蚊":0.1,"三带喙库蚊":0.03,"中华按蚊":0.005,"致倦库蚊":0.86},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.86,"白纹伊蚊":0.1,"三带喙库蚊":0.03,"中华按蚊":0.005,"致倦库蚊":0.86}
//            },
//            11: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.86,"白纹伊蚊":0.1,"三带喙库蚊":0.03,"中华按蚊":0.005,"致倦库蚊":0.86},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.86,"白纹伊蚊":0.1,"三带喙库蚊":0.03,"中华按蚊":0.005,"致倦库蚊":0.86}
//            }
//        }
//    },
//    '海南省': {
//        start:{start_hour: 6, start_min: 2},
//        end:{end_hour: 19, end_min: 15},
//        dayRiskRate: 0.65,
//        nightRiskRate: 0.8361,
//        diseaseRate: 0.000002347,
//        insects: {
//            12: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.9497,"白纹伊蚊":0.0118,"三带喙库蚊":0.0353,"中华按蚊":0.0032,"致倦库蚊":0.9497},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.9439,"白纹伊蚊":0.06,"三带喙库蚊":0.03,"中华按蚊":0,"致倦库蚊":0.9439}
//            },
//            1: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.9497,"白纹伊蚊":0.0118,"三带喙库蚊":0.0353,"中华按蚊":0.0032,"致倦库蚊":0.9497},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.9439,"白纹伊蚊":0.06,"三带喙库蚊":0.03,"中华按蚊":0,"致倦库蚊":0.9439}
//            },
//            2: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.9497,"白纹伊蚊":0.0118,"三带喙库蚊":0.0353,"中华按蚊":0.0032,"致倦库蚊":0.9497},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.9439,"白纹伊蚊":0.06,"三带喙库蚊":0.03,"中华按蚊":0,"致倦库蚊":0.9439}
//            },
//            3: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.721,"白纹伊蚊":0.0488,"三带喙库蚊":0.222,"中华按蚊":0.008,"致倦库蚊":0.721},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.7899,"白纹伊蚊":0.0266,"三带喙库蚊":0.1833,"中华按蚊":0,"致倦库蚊":0.7899}
//            },
//            4: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.721,"白纹伊蚊":0.0488,"三带喙库蚊":0.222,"中华按蚊":0.008,"致倦库蚊":0.721},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.7899,"白纹伊蚊":0.0266,"三带喙库蚊":0.1833,"中华按蚊":0,"致倦库蚊":0.7899}
//            },
//            5: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.721,"白纹伊蚊":0.0488,"三带喙库蚊":0.222,"中华按蚊":0.008,"致倦库蚊":0.721},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.7899,"白纹伊蚊":0.0266,"三带喙库蚊":0.1833,"中华按蚊":0,"致倦库蚊":0.7899}
//            },
//            6: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.8361,"白纹伊蚊":0.1133,"三带喙库蚊":0.0341,"中华按蚊":0.0164,"致倦库蚊":0.8361},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.8831,"白纹伊蚊":0.0883,"三带喙库蚊":0.0213,"中华按蚊":0.0073,"致倦库蚊":0.8831}
//            },
//            7: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.8361,"白纹伊蚊":0.1133,"三带喙库蚊":0.0341,"中华按蚊":0.0164,"致倦库蚊":0.8361},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.8831,"白纹伊蚊":0.0883,"三带喙库蚊":0.0213,"中华按蚊":0.0073,"致倦库蚊":0.8831}
//            },
//            8: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.8361,"白纹伊蚊":0.1133,"三带喙库蚊":0.0341,"中华按蚊":0.0164,"致倦库蚊":0.8361},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.8831,"白纹伊蚊":0.0883,"三带喙库蚊":0.0213,"中华按蚊":0.0073,"致倦库蚊":0.8831}
//            },
//            9: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.8361,"白纹伊蚊":0.1133,"三带喙库蚊":0.0341,"中华按蚊":0.0164,"致倦库蚊":0.8361},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.8831,"白纹伊蚊":0.0883,"三带喙库蚊":0.0213,"中华按蚊":0.0073,"致倦库蚊":0.8831}
//            },
//            10: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.8361,"白纹伊蚊":0.1133,"三带喙库蚊":0.0341,"中华按蚊":0.0164,"致倦库蚊":0.8361},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.8831,"白纹伊蚊":0.0883,"三带喙库蚊":0.0213,"中华按蚊":0.0073,"致倦库蚊":0.8831}
//            },
//            11: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.8361,"白纹伊蚊":0.1133,"三带喙库蚊":0.0341,"中华按蚊":0.0164,"致倦库蚊":0.8361},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.8831,"白纹伊蚊":0.0883,"三带喙库蚊":0.0213,"中华按蚊":0.0073,"致倦库蚊":0.8831}
//            }
//        }
//    },
//    '福建省': {
//        start:{start_hour: 5, start_min: 14},
//        end:{end_hour: 18, end_min: 57},
//        dayRiskRate: 0.65,
//        nightRiskRate: 0.8974,
//        diseaseRate: 0.000007525,
//        insects: {
//            12: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":1,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":1},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.9808,"白纹伊蚊":0,"三带喙库蚊":0.0096,"中华按蚊":0.0096,"致倦库蚊":0.9808}
//            },
//            1: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":1,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":1},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.9808,"白纹伊蚊":0,"三带喙库蚊":0.0096,"中华按蚊":0.0096,"致倦库蚊":0.9808}
//            },
//            2: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":1,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":1},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.9808,"白纹伊蚊":0,"三带喙库蚊":0.0096,"中华按蚊":0.0096,"致倦库蚊":0.9808}
//            },
//            3: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.9765,"白纹伊蚊":0.0235,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0.9765},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.9698,"白纹伊蚊":0.0113,"三带喙库蚊":0,"中华按蚊":0.0189,"致倦库蚊":0.9698}
//            },
//            4: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.9765,"白纹伊蚊":0.0235,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0.9765},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.9698,"白纹伊蚊":0.0113,"三带喙库蚊":0,"中华按蚊":0.0189,"致倦库蚊":0.9698}
//            },
//            5: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.9765,"白纹伊蚊":0.0235,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0.9765},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.9698,"白纹伊蚊":0.0113,"三带喙库蚊":0,"中华按蚊":0.0189,"致倦库蚊":0.9698}
//            },
//            6: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.8974,"白纹伊蚊":0.0949,"三带喙库蚊":0.0077,"中华按蚊":0,"致倦库蚊":0.8974},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.928,"白纹伊蚊":0.048,"三带喙库蚊":0.0188,"中华按蚊":0.0052,"致倦库蚊":0.928}
//            },
//            7: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.8974,"白纹伊蚊":0.0949,"三带喙库蚊":0.0077,"中华按蚊":0,"致倦库蚊":0.8974},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.928,"白纹伊蚊":0.048,"三带喙库蚊":0.0188,"中华按蚊":0.0052,"致倦库蚊":0.928}
//            },
//            8: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.8974,"白纹伊蚊":0.0949,"三带喙库蚊":0.0077,"中华按蚊":0,"致倦库蚊":0.8974},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.928,"白纹伊蚊":0.048,"三带喙库蚊":0.0188,"中华按蚊":0.0052,"致倦库蚊":0.928}
//            },
//            9: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.8974,"白纹伊蚊":0.0949,"三带喙库蚊":0.0077,"中华按蚊":0,"致倦库蚊":0.8974},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.928,"白纹伊蚊":0.048,"三带喙库蚊":0.0188,"中华按蚊":0.0052,"致倦库蚊":0.928}
//            },
//            10: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.8974,"白纹伊蚊":0.0949,"三带喙库蚊":0.0077,"中华按蚊":0,"致倦库蚊":0.8974},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.928,"白纹伊蚊":0.048,"三带喙库蚊":0.0188,"中华按蚊":0.0052,"致倦库蚊":0.928}
//            },
//            11: {
//                city_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                city_night: {"单色库蚊":0.8974,"白纹伊蚊":0.0949,"三带喙库蚊":0.0077,"中华按蚊":0,"致倦库蚊":0.8974},
//                rural_day: {"单色库蚊":0.3,"白纹伊蚊":0.65,"三带喙库蚊":0.04,"中华按蚊":0.005,"致倦库蚊":0.3},
//                rural_night: {"单色库蚊":0.928,"白纹伊蚊":0.048,"三带喙库蚊":0.0188,"中华按蚊":0.0052,"致倦库蚊":0.928}
//            }
//        }
//    },
//    '浙江省': {
//        start:{start_hour: 5, start_min: 13},
//        end:{end_hour: 18, end_min: 47},
//        dayRiskRate: 0.7,
//        nightRiskRate: 0.7430,
//        diseaseRate: 0.000003692,
//        insects: {
//            12: {
//                city_day: {"单色库蚊":0.245,"白纹伊蚊":0.7,"三带喙库蚊":0.05,"中华按蚊":0.005,"致倦库蚊":0.245},
//                city_night: {"单色库蚊":0.743,"白纹伊蚊":0.02,"三带喙库蚊":0.23,"中华按蚊":0.007,"致倦库蚊":0.743},
//                rural_day: {"单色库蚊":0.245,"白纹伊蚊":0.7,"三带喙库蚊":0.05,"中华按蚊":0.005,"致倦库蚊":0.245},
//                rural_night: {"单色库蚊":0.743,"白纹伊蚊":0.02,"三带喙库蚊":0.23,"中华按蚊":0.007,"致倦库蚊":0.743}
//            },
//            1: {
//                city_day: {"单色库蚊":0.245,"白纹伊蚊":0.7,"三带喙库蚊":0.05,"中华按蚊":0.005,"致倦库蚊":0.245},
//                city_night: {"单色库蚊":0.743,"白纹伊蚊":0.02,"三带喙库蚊":0.23,"中华按蚊":0.007,"致倦库蚊":0.743},
//                rural_day: {"单色库蚊":0.245,"白纹伊蚊":0.7,"三带喙库蚊":0.05,"中华按蚊":0.005,"致倦库蚊":0.245},
//                rural_night: {"单色库蚊":0.743,"白纹伊蚊":0.02,"三带喙库蚊":0.23,"中华按蚊":0.007,"致倦库蚊":0.743}
//            },
//            2: {
//                city_day: {"单色库蚊":0.245,"白纹伊蚊":0.7,"三带喙库蚊":0.05,"中华按蚊":0.005,"致倦库蚊":0.245},
//                city_night: {"单色库蚊":0.743,"白纹伊蚊":0.02,"三带喙库蚊":0.23,"中华按蚊":0.007,"致倦库蚊":0.743},
//                rural_day: {"单色库蚊":0.245,"白纹伊蚊":0.7,"三带喙库蚊":0.05,"中华按蚊":0.005,"致倦库蚊":0.245},
//                rural_night: {"单色库蚊":0.743,"白纹伊蚊":0.02,"三带喙库蚊":0.23,"中华按蚊":0.007,"致倦库蚊":0.743}
//            },
//            3: {
//                city_day: {"单色库蚊":0.245,"白纹伊蚊":0.7,"三带喙库蚊":0.05,"中华按蚊":0.005,"致倦库蚊":0.245},
//                city_night: {"单色库蚊":0.743,"白纹伊蚊":0.02,"三带喙库蚊":0.23,"中华按蚊":0.007,"致倦库蚊":0.743},
//                rural_day: {"单色库蚊":0.245,"白纹伊蚊":0.7,"三带喙库蚊":0.05,"中华按蚊":0.005,"致倦库蚊":0.245},
//                rural_night: {"单色库蚊":0.743,"白纹伊蚊":0.02,"三带喙库蚊":0.23,"中华按蚊":0.007,"致倦库蚊":0.743}
//            },
//            4: {
//                city_day: {"单色库蚊":0.245,"白纹伊蚊":0.7,"三带喙库蚊":0.05,"中华按蚊":0.005,"致倦库蚊":0.245},
//                city_night: {"单色库蚊":0.743,"白纹伊蚊":0.02,"三带喙库蚊":0.23,"中华按蚊":0.007,"致倦库蚊":0.743},
//                rural_day: {"单色库蚊":0.245,"白纹伊蚊":0.7,"三带喙库蚊":0.05,"中华按蚊":0.005,"致倦库蚊":0.245},
//                rural_night: {"单色库蚊":0.743,"白纹伊蚊":0.02,"三带喙库蚊":0.23,"中华按蚊":0.007,"致倦库蚊":0.743}
//            },
//            5: {
//                city_day: {"单色库蚊":0.245,"白纹伊蚊":0.7,"三带喙库蚊":0.05,"中华按蚊":0.005,"致倦库蚊":0.245},
//                city_night: {"单色库蚊":0.743,"白纹伊蚊":0.02,"三带喙库蚊":0.23,"中华按蚊":0.007,"致倦库蚊":0.743},
//                rural_day: {"单色库蚊":0.245,"白纹伊蚊":0.7,"三带喙库蚊":0.05,"中华按蚊":0.005,"致倦库蚊":0.245},
//                rural_night: {"单色库蚊":0.743,"白纹伊蚊":0.02,"三带喙库蚊":0.23,"中华按蚊":0.007,"致倦库蚊":0.743}
//            },
//            6: {
//                city_day: {"单色库蚊":0.245,"白纹伊蚊":0.7,"三带喙库蚊":0.05,"中华按蚊":0.005,"致倦库蚊":0.245},
//                city_night: {"单色库蚊":0.743,"白纹伊蚊":0.02,"三带喙库蚊":0.23,"中华按蚊":0.007,"致倦库蚊":0.743},
//                rural_day: {"单色库蚊":0.245,"白纹伊蚊":0.7,"三带喙库蚊":0.05,"中华按蚊":0.005,"致倦库蚊":0.245},
//                rural_night: {"单色库蚊":0.743,"白纹伊蚊":0.02,"三带喙库蚊":0.23,"中华按蚊":0.007,"致倦库蚊":0.743}
//            },
//            7: {
//                city_day: {"单色库蚊":0.245,"白纹伊蚊":0.7,"三带喙库蚊":0.05,"中华按蚊":0.005,"致倦库蚊":0.245},
//                city_night: {"单色库蚊":0.743,"白纹伊蚊":0.02,"三带喙库蚊":0.23,"中华按蚊":0.007,"致倦库蚊":0.743},
//                rural_day: {"单色库蚊":0.245,"白纹伊蚊":0.7,"三带喙库蚊":0.05,"中华按蚊":0.005,"致倦库蚊":0.245},
//                rural_night: {"单色库蚊":0.743,"白纹伊蚊":0.02,"三带喙库蚊":0.23,"中华按蚊":0.007,"致倦库蚊":0.743}
//            },
//            8: {
//                city_day: {"单色库蚊":0.245,"白纹伊蚊":0.7,"三带喙库蚊":0.05,"中华按蚊":0.005,"致倦库蚊":0.245},
//                city_night: {"单色库蚊":0.743,"白纹伊蚊":0.02,"三带喙库蚊":0.23,"中华按蚊":0.007,"致倦库蚊":0.743},
//                rural_day: {"单色库蚊":0.245,"白纹伊蚊":0.7,"三带喙库蚊":0.05,"中华按蚊":0.005,"致倦库蚊":0.245},
//                rural_night: {"单色库蚊":0.743,"白纹伊蚊":0.02,"三带喙库蚊":0.23,"中华按蚊":0.007,"致倦库蚊":0.743}
//            },
//            9: {
//                city_day: {"单色库蚊":0.245,"白纹伊蚊":0.7,"三带喙库蚊":0.05,"中华按蚊":0.005,"致倦库蚊":0.245},
//                city_night: {"单色库蚊":0.743,"白纹伊蚊":0.02,"三带喙库蚊":0.23,"中华按蚊":0.007,"致倦库蚊":0.743},
//                rural_day: {"单色库蚊":0.245,"白纹伊蚊":0.7,"三带喙库蚊":0.05,"中华按蚊":0.005,"致倦库蚊":0.245},
//                rural_night: {"单色库蚊":0.743,"白纹伊蚊":0.02,"三带喙库蚊":0.23,"中华按蚊":0.007,"致倦库蚊":0.743}
//            },
//            10: {
//                city_day: {"单色库蚊":0.245,"白纹伊蚊":0.7,"三带喙库蚊":0.05,"中华按蚊":0.005,"致倦库蚊":0.245},
//                city_night: {"单色库蚊":0.743,"白纹伊蚊":0.02,"三带喙库蚊":0.23,"中华按蚊":0.007,"致倦库蚊":0.743},
//                rural_day: {"单色库蚊":0.245,"白纹伊蚊":0.7,"三带喙库蚊":0.05,"中华按蚊":0.005,"致倦库蚊":0.245},
//                rural_night: {"单色库蚊":0.743,"白纹伊蚊":0.02,"三带喙库蚊":0.23,"中华按蚊":0.007,"致倦库蚊":0.743}
//            },
//            11: {
//                city_day: {"单色库蚊":0.245,"白纹伊蚊":0.7,"三带喙库蚊":0.05,"中华按蚊":0.005,"致倦库蚊":0.245},
//                city_night: {"单色库蚊":0.743,"白纹伊蚊":0.02,"三带喙库蚊":0.23,"中华按蚊":0.007,"致倦库蚊":0.743},
//                rural_day: {"单色库蚊":0.245,"白纹伊蚊":0.7,"三带喙库蚊":0.05,"中华按蚊":0.005,"致倦库蚊":0.245},
//                rural_night: {"单色库蚊":0.743,"白纹伊蚊":0.02,"三带喙库蚊":0.23,"中华按蚊":0.007,"致倦库蚊":0.743}
//            }
//        }
//    },
//    '上海市': {
//        start:{start_hour: 8, start_min: 0},
//        end:{end_hour: 20, end_min: 0},
//        dayRiskRate: 0.4376,
//        nightRiskRate: 0.7814,
//        diseaseRate: 0.000000911,
//        insects: {
//            12: {
//                city_day: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0},
//                city_night: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0},
//                rural_day: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0},
//                rural_night: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0}
//            },
//            1: {
//                city_day: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0},
//                city_night: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0},
//                rural_day: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0},
//                rural_night: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0}
//            },
//            2: {
//                city_day: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0},
//                city_night: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0},
//                rural_day: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0},
//                rural_night: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0}
//            },
//            3: {
//                city_day: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0},
//                city_night: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0},
//                rural_day: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0},
//                rural_night: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0}
//            },
//            4: {
//                city_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                city_night: {"单色库蚊":0.7814,"白纹伊蚊":0.1376,"三带喙库蚊":0.0901,"中华按蚊":0.0018,"致倦库蚊":0.7814},
//                rural_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                rural_night: {"单色库蚊":1,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":1}
//            },
//            5: {
//                city_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                city_night: {"单色库蚊":0.7814,"白纹伊蚊":0.1376,"三带喙库蚊":0.0901,"中华按蚊":0.0018,"致倦库蚊":0.7814},
//                rural_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                rural_night: {"单色库蚊":1,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":1}
//            },
//            6: {
//                city_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                city_night: {"单色库蚊":0.7814,"白纹伊蚊":0.1376,"三带喙库蚊":0.0901,"中华按蚊":0.0018,"致倦库蚊":0.7814},
//                rural_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                rural_night: {"单色库蚊":0.5897,"白纹伊蚊":0,"三带喙库蚊":0.3455,"中华按蚊":0.0648,"致倦库蚊":0.5897}
//            },
//            7: {
//                city_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                city_night: {"单色库蚊":0.7814,"白纹伊蚊":0.1376,"三带喙库蚊":0.0901,"中华按蚊":0.0018,"致倦库蚊":0.7814},
//                rural_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                rural_night: {"单色库蚊":0.5897,"白纹伊蚊":0,"三带喙库蚊":0.3455,"中华按蚊":0.0648,"致倦库蚊":0.5897}
//            },
//            8: {
//                city_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                city_night: {"单色库蚊":0.7814,"白纹伊蚊":0.1376,"三带喙库蚊":0.0901,"中华按蚊":0.0018,"致倦库蚊":0.7814},
//                rural_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                rural_night: {"单色库蚊":0.5897,"白纹伊蚊":0,"三带喙库蚊":0.3455,"中华按蚊":0.0648,"致倦库蚊":0.5897}
//            },
//            9: {
//                city_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                city_night: {"单色库蚊":0.7814,"白纹伊蚊":0.1376,"三带喙库蚊":0.0901,"中华按蚊":0.0018,"致倦库蚊":0.7814},
//                rural_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                rural_night: {"单色库蚊":0.5897,"白纹伊蚊":0,"三带喙库蚊":0.3455,"中华按蚊":0.0648,"致倦库蚊":0.5897}
//            },
//            10: {
//                city_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                city_night: {"单色库蚊":0.7814,"白纹伊蚊":0.1376,"三带喙库蚊":0.0901,"中华按蚊":0.0018,"致倦库蚊":0.7814},
//                rural_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                rural_night: {"单色库蚊":0.5897,"白纹伊蚊":0,"三带喙库蚊":0.3455,"中华按蚊":0.0648,"致倦库蚊":0.5897}
//            },
//            11: {
//                city_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                city_night: {"单色库蚊":0.7814,"白纹伊蚊":0.1376,"三带喙库蚊":0.0901,"中华按蚊":0.0018,"致倦库蚊":0.7814},
//                rural_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                rural_night: {"单色库蚊":0.5897,"白纹伊蚊":0,"三带喙库蚊":0.3455,"中华按蚊":0.0648,"致倦库蚊":0.5897}
//            }
//        }
//    },
//    '北京市': {
//        start:{start_hour: 8, start_min: 0},
//        end:{end_hour: 20, end_min: 0},
//        dayRiskRate: 0.4376,
//        nightRiskRate: 0.7814,
//        diseaseRate: 0.000000911,
//        insects: {
//            12: {
//                city_day: {},
//                city_night: {},
//                rural_day: {},
//                rural_night: {}
//            },
//            1: {
//                city_day: {},
//                city_night: {},
//                rural_day: {},
//                rural_night: {}
//            },
//            2: {
//                city_day: {},
//                city_night: {},
//                rural_day: {},
//                rural_night: {}
//            },
//            3: {
//                city_day: {},
//                city_night: {},
//                rural_day: {},
//                rural_night: {}
//            },
//            9: {
//                city_day: {
//                    "致倦库蚊": 0.4735,
//                    "白纹伊蚊": 0.4376,
//                    "三带喙库蚊": 0.0609,
//                    "中华按蚊": 0.0009
//                },
//                city_night: {
//                    "致倦库蚊": 0.7814,
//                    "白纹伊蚊": 0.1267,
//                    "三带喙库蚊": 0.0901,
//                    "中华按蚊": 0.0018
//                },
//                rural_day: {
//                    "致倦库蚊": 0.4735,
//                    "白纹伊蚊": 0.4376,
//                    "三带喙库蚊": 0.0609,
//                    "中华按蚊": 0.0009
//                },
//                rural_night: {
//                    "致倦库蚊": 0.5897,
//                    "三带喙库蚊": 0.3455,
//                    "中华按蚊": 0.0648
//                }
//            },
//            10: {
//                city_day: {
//                    "致倦库蚊": 0.4735,
//                    "白纹伊蚊": 0.4376,
//                    "三带喙库蚊": 0.0609,
//                    "中华按蚊": 0.0009
//                },
//                city_night: {
//                    "致倦库蚊": 0.7814,
//                    "白纹伊蚊": 0.1267,
//                    "三带喙库蚊": 0.0901,
//                    "中华按蚊": 0.0018
//                },
//                rural_day: {
//                    "致倦库蚊": 0.4735,
//                    "白纹伊蚊": 0.4376,
//                    "三带喙库蚊": 0.0609,
//                    "中华按蚊": 0.0009
//                },
//                rural_night: {
//                    "致倦库蚊": 0.5897,
//                    "三带喙库蚊": 0.3455,
//                    "中华按蚊": 0.0648
//                }
//            }
//        }
//    },
//    '河北省': {
//        start:{start_hour: 8, start_min: 0},
//        end:{end_hour: 20, end_min: 0},
//        dayRiskRate: 0.4376,
//        nightRiskRate: 0.7814,
//        diseaseRate: 0.000000911,
//        insects: {
//            12: {
//                city_day: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0},
//                city_night: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0},
//                rural_day: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0},
//                rural_night: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0}
//            },
//            1: {
//                city_day: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0},
//                city_night: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0},
//                rural_day: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0},
//                rural_night: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0}
//            },
//            2: {
//                city_day: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0},
//                city_night: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0},
//                rural_day: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0},
//                rural_night: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0}
//            },
//            3: {
//                city_day: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0},
//                city_night: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0},
//                rural_day: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0},
//                rural_night: {"单色库蚊":0,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":0}
//            },
//            4: {
//                city_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                city_night: {"单色库蚊":0.7814,"白纹伊蚊":0.1376,"三带喙库蚊":0.0901,"中华按蚊":0.0018,"致倦库蚊":0.7814},
//                rural_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                rural_night: {"单色库蚊":1,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":1}
//            },
//            5: {
//                city_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                city_night: {"单色库蚊":0.7814,"白纹伊蚊":0.1376,"三带喙库蚊":0.0901,"中华按蚊":0.0018,"致倦库蚊":0.7814},
//                rural_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                rural_night: {"单色库蚊":1,"白纹伊蚊":0,"三带喙库蚊":0,"中华按蚊":0,"致倦库蚊":1}
//            },
//            6: {
//                city_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                city_night: {"单色库蚊":0.7814,"白纹伊蚊":0.1376,"三带喙库蚊":0.0901,"中华按蚊":0.0018,"致倦库蚊":0.7814},
//                rural_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                rural_night: {"单色库蚊":0.5897,"白纹伊蚊":0,"三带喙库蚊":0.3455,"中华按蚊":0.0648,"致倦库蚊":0.5897}
//            },
//            7: {
//                city_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                city_night: {"单色库蚊":0.7814,"白纹伊蚊":0.1376,"三带喙库蚊":0.0901,"中华按蚊":0.0018,"致倦库蚊":0.7814},
//                rural_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                rural_night: {"单色库蚊":0.5897,"白纹伊蚊":0,"三带喙库蚊":0.3455,"中华按蚊":0.0648,"致倦库蚊":0.5897}
//            },
//            8: {
//                city_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                city_night: {"单色库蚊":0.7814,"白纹伊蚊":0.1376,"三带喙库蚊":0.0901,"中华按蚊":0.0018,"致倦库蚊":0.7814},
//                rural_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                rural_night: {"单色库蚊":0.5897,"白纹伊蚊":0,"三带喙库蚊":0.3455,"中华按蚊":0.0648,"致倦库蚊":0.5897}
//            },
//            9: {
//                city_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                city_night: {"单色库蚊":0.7814,"白纹伊蚊":0.1376,"三带喙库蚊":0.0901,"中华按蚊":0.0018,"致倦库蚊":0.7814},
//                rural_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                rural_night: {"单色库蚊":0.5897,"白纹伊蚊":0,"三带喙库蚊":0.3455,"中华按蚊":0.0648,"致倦库蚊":0.5897}
//            },
//            10: {
//                city_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                city_night: {"单色库蚊":0.7814,"白纹伊蚊":0.1376,"三带喙库蚊":0.0901,"中华按蚊":0.0018,"致倦库蚊":0.7814},
//                rural_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                rural_night: {"单色库蚊":0.5897,"白纹伊蚊":0,"三带喙库蚊":0.3455,"中华按蚊":0.0648,"致倦库蚊":0.5897}
//            },
//            11: {
//                city_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                city_night: {"单色库蚊":0.7814,"白纹伊蚊":0.1376,"三带喙库蚊":0.0901,"中华按蚊":0.0018,"致倦库蚊":0.7814},
//                rural_day: {"单色库蚊":0.4735,"白纹伊蚊":0.4376,"三带喙库蚊":0.0609,"中华按蚊":0.0009,"致倦库蚊":0.4375},
//                rural_night: {"单色库蚊":0.5897,"白纹伊蚊":0,"三带喙库蚊":0.3455,"中华按蚊":0.0648,"致倦库蚊":0.5897}
//            }
//        }
//    }
//};

//var PROVINCES = ['广东省','云南省','广西壮族自治区','海南省','福建省','浙江省','上海市','河北省','北京市'];10.8.11.31

//var INSECTS = {
//    "致倦库蚊": {
//        img: {url: "http://ac-fdcqzam1.clouddn.com/08b1ec55e383bfae2126.png"},
//        illness: [{
//            "title": "流行性乙型脑炎",
//            "content": "是由嗜神经的乙脑病毒所致的中枢神经系统性传染病。本病主要分布在亚洲远东和东南亚地区，经蚊传播，多见于夏秋季，临床上急起发病，有高热、意识障碍、惊厥、强直性痉挛和脑膜刺激征等，重型患者病后往往留有后遗症。"
//        }]
//    },
//    "三带喙库蚊": {
//        img: {url: "http://ac-fdcqzam1.clouddn.com/dafee23befd0680ef6b9.png"},
//        illness: [{
//            "title": "登革热",
//            "content": "是登革病毒经蚊媒传播引起的急性虫媒传染病。登革病毒感染后可导致隐性感染、登革热、登革出血热，登革出血热我国少见。典型的登革热临床表现为起病急骤，高热，头痛，肌肉、骨关节剧烈酸痛、部分患者出现皮疹、出血倾向、淋巴结肿大、白细胞计数减少、血小板减少等。本病主要在热带和亚热带地区流行，我国广东、香港、澳门等地是登革热流行区。"
//        }]
//    },
//    "中华按蚊": {
//        img: {url: "http://ac-fdcqzam1.clouddn.com/b6518f43158318bde75b.png"},
//        illness: [{
//            "title": "黄热病",
//            "content": "黄热病是一种病毒性疾病，见于非洲和美洲的热带地区。该病主要影响人类和猴子，通过伊蚊叮咬传播。该病可造成破坏性极强的疫情，通过大规模疫苗接种运动可予以预防和控制。"
//        }]
//    },
//    "白纹伊蚊": {
//        img: {url: "http://ac-fdcqzam1.clouddn.com/5d325f8fe0a3f83c287f.png"},
//        illness: [{
//            "title": "疟疾",
//            "content": "疟疾由一种叫作疟原虫的寄生虫引起，通过受感染蚊子的叮咬传播。这种寄生虫在人体的肝脏中繁殖，然后感染血红细胞。"
//        }]
//    }
//};10.8.11.16

//AV.Cloud.define('save_vaid_provinces', function (request, response) {
//    for(var i=0;i<PROVINCES.length;i++){
//        var VaidProvinces = AV.Object.extend('VaidProvinces');
//        var vaidProvinces = new VaidProvinces();
//        vaidProvinces.set('provinces_name',PROVINCES[i]);
//        vaidProvinces.set('start',VALID_PROVINCES[PROVINCES[i]].start);
//        vaidProvinces.set('end',VALID_PROVINCES[PROVINCES[i]].end);
//        vaidProvinces.set('dayRiskRate',VALID_PROVINCES[PROVINCES[i]].dayRiskRate);
//        vaidProvinces.set('nightRiskRate',VALID_PROVINCES[PROVINCES[i]].nightRiskRate);
//        vaidProvinces.set('diseaseRate',VALID_PROVINCES[PROVINCES[i]].diseaseRate);
//        vaidProvinces.set('insects',VALID_PROVINCES[PROVINCES[i]].insects);
//        vaidProvinces.save();
//    }
//    response.success('保存成功')
//});10.8.11.31

var SYMPTOM_DISEASE = {
    "发热": ["登革热", "流行性乙脑", "疟疾", "基孔肯雅热", "寨卡病毒病", "黄热病"],
    "头痛": ["流行性乙脑", "疟疾", "基孔肯雅热", "寨卡病毒病", "黄热病"],
    "头痛伴眼眶痛": ["登革热"],
    "肌肉酸痛": ["登革热", "寨卡病毒病"],
    "骨关节痛": ["登革热", "基孔肯雅热", "寨卡病毒病"],
    "皮疹": ["登革热", "基孔肯雅热", "寨卡病毒病"],
    "出血": ["登革热"],
    "恶心": ["基孔肯雅热"],
    "呕吐": ["流行性乙脑", "基孔肯雅热"],
    "结膜炎": ["寨卡病毒病"],
    "全身乏力": ["寨卡病毒病"],
    "寒战": ["黄热病"],
    "烦躁": ["流行性乙脑"],
    "意识障碍": ["流行性乙脑"],
    "惊厥": ["流行性乙脑"],
    "周期性发冷发热": ["疟疾"],
    "出汗": ["疟疾"],
}

var DISEASE_INCUBATION_DAYS = {
    "登革热": 20,
    "基孔肯雅热": 15,
    "寨卡病毒病": 15,
    "黄热病": 10,
    "流行性乙脑": 25,
    "疟疾": 30
}

function diagnose(lat, lon, time, symptoms, family_disease, lastPicture) {
    return new Promise(function (fulfill, reject) {
        var t = new Date(time);
        if (t == 'Invalid Date') {
            reject('invalid date');
            return;
        }
        console.log(t);
        getProvince(lat, lon)
            .then(function (province) {
                var querys = new AV.Query('VaidProvinces');
                querys.equalTo('provinces_name', province);
                return querys.find().then(function (results) {
                    var provinces_item = results[0];
                    if (provinces_item) {
                        var minCount = t.getHours() * 60 + t.getMinutes();
                        console.log(provinces_item.get('start').start_hour);
                        // console.log((provinces_item.get('start_hour') * 60 + provinces_item.get('start_min')));
                        // console.log("minCount:" + minCount);
                        if (minCount > (provinces_item.get('start').start_hour * 60 + provinces_item.get('start').start_min) &&
                            minCount < (provinces_item.get('end').end_hour * 60 + provinces_item.get('end').end_min)) {
                            console.log('DAY diseaseRate:' + provinces_item.attributes.diseaseRate);
                            return Promise.resolve({
                                mozRiskRate: provinces_item.attributes.dayRiskRate,
                                diseaseRate: provinces_item.attributes.diseaseRate
                            });
                        } else {
                            console.log('NIGHT diseaseRate:' + provinces_item.attributes.diseaseRate);
                            return Promise.resolve({
                                mozRiskRate: provinces_item.attributes.nightRiskRate,
                                diseaseRate: provinces_item.attributes.diseaseRate
                            });
                        }
                    } else {
                        reject('invalid location');
                        return;
                    }
                }, function (error) {
                    console.log(error)
                    reject('invalid location');
                });
            })
            .then(function (rates) {
                var result;
                var dRate = (rates.diseaseRate * 100000) * 40;
                dRate = (dRate > 40) ? 40 : dRate;
                console.log("dRate:" + dRate);
                console.log("rates.mozRiskRate:" + rates.mozRiskRate);
                if (typeof family_disease != 'undefined') {
                    result = 40 - dRate * 0.8 + rates.mozRiskRate * 35 + 25;
                } else {
                    result = (dRate + rates.mozRiskRate * 35 + 25);
                    if (symptoms.indexOf("无以上症状") >= 0) {
                        result = result * 0.2;
                    } else {
                        var diseases = [];
                        _.each(symptoms, function (s) {
                            diseases = _.union(SYMPTOM_DISEASE[s], diseases);
                        })
                        var max_incubation_days = 0;
                        _.each(diseases, function (d) {
                            if (max_incubation_days < DISEASE_INCUBATION_DAYS[d]) {
                                max_incubation_days = DISEASE_INCUBATION_DAYS[d];
                            }
                        })

                        var lastPictureBeforeDays = Math.ceil((new Date() - lastPicture) / 1000 / 60 / 60 / 24);
                        var inIncubationPeriod = (lastPictureBeforeDays < max_incubation_days);

                        if (inIncubationPeriod) {
                            console.log("潜伏期," + result);
                            result = result * 1;
                        } else {
                            console.log("非潜伏期," + result);
                            result = (symptoms && symptoms.length > 0) ? result * 0.5 : result * 0.2;
                        }
                    }
                }
                result = Math.round(result);
                fulfill(result);
            }, function (err) {
                reject(err);
            })
        if (symptoms && symptoms.length == 0) {

        }
    });
}

function insect_statistic(lat, lon, time) {
    return new Promise(function (fulfill, reject) {
        var t = new Date(time);
        if (t == 'Invalid Date') {
            reject('invalid date');
        } else {
            getProvince(lat, lon)
                .then(function (province) {
                    console.log(province);
                    var querys = new AV.Query('VaidProvinces');
                    querys.find().then(function (results) {
                        for (var i = 0; i < results.length; i++) {
                            var provinces_item = results[i];
                            if (province == provinces_item.attributes.provinces_name || (provinces_item.attributes.provinces_name != province && i == (results.length - 1))) {
                                var minCount = t.getHours() * 60 + t.getMinutes();
                                if (minCount > (provinces_item.attributes.start.start_hour * 60 + provinces_item.attributes.start.start_min) &&
                                    minCount < (provinces_item.attributes.end.end_hour * 60 + provinces_item.attributes.end.end_min)) {
                                    fulfill(provinces_item.attributes.insects[t.getMonth() + 1].city_day);
                                } else {
                                    fulfill(provinces_item.attributes.insects[t.getMonth() + 1].city_night);
                                }
                                break;
                            }
                        }
                    }, function (error) {
                        console.log('i')
                        console.log(error)
                    })
                })
        }

    })
}

AV.Cloud.define('insect_statistic', function (request, response) {
    var lat = request.params.lat,
        lon = request.params.lon,
        time = request.params.time;
    console.log('insect_statistic', JSON.stringify(request.params));
    insect_statistic(lat, lon, time)
        .then(function (insects) {
            var result = [];
            var querys = new AV.Query('Insect');
            querys.find().then(function (results) {
                for (var j = 0; j < results.length; j++) {
                    var a = results[j]
                    for (var i in insects) {
                        //if (INSECTS[i])10.8.11
                        if (i == a.attributes.name) {
                            result.push({
                                name: i,
                                img: a.attributes.img,
                                illness: a.attributes.illness,
                                chance: insects[i]
                            });
                        }
                    }
                }

                // console.log("result");
                // console.log(_.sortBy(result, 'chance').reverse().slice(0, 3));

                response.success({
                    // insects: result
                    insects: _.sortBy(result, 'chance').reverse().slice(0, 3)
                });
            }, function (error) {
                console.log(error)
            })
        }, function (err) {
            console.log('2')
            response.error(err);
        })
});

AV.Cloud.define('is_available', function (request, response) {
    //console.log('is_available,' + JSON.stringify(request.params));10.8.11
    getProvince(request.params.lat, request.params.lon)
        .then(function (result) {
            var querys = new AV.Query('VaidProvinces');
            querys.equalTo('provinces_name', result);
            querys.find().then(function (results) {
                if (results[0] != undefined) {
                    response.success({
                        valid: true
                    })
                } else {
                    response.success({
                        valid: false
                    })
                }
            }, function (error) {
                response.error(error)
            })

        }, function (err) {
            response.success({
                valid: false,
                error: err
            })
        })
});

var SUGGESTION_TEMPLATE = {};

var dateFormat = require('dateformat');

var getSuggestion = function (grade, symptoms, family_disease, last_picture_at) {
    var t = dateFormat(last_picture_at, "yyyy-MM-d H:m:s");
    if (symptoms.length == 1 && symptoms[0] == '无以上症状' && family_disease.length == 0) {
        return "根据" + t + "上传的蚊子叮咬部位图片，结合本地区传染病流行风险，建议继续自我观察，如出现上述症状请再次评估。";
    } else if (symptoms.length == 1 && symptoms[0] == '无以上症状' && family_disease.length > 0) {
        return "根据" + t + "上传的蚊子叮咬部位图片，结合本地区传染病流行风险以及共同居住的家人已有" + family_disease[0] + "发病，建议继续自我观察，如出现上述症状请及时到医院就诊。";
    } else if (grade > 0 && grade <= 25) {
        return "根据" + t + "上传的蚊子叮咬部位图片，结合当前症状和本地区传染病流行风险，建议继续自我观察，如出现症状加重应及时到医院就诊。"
    } else if (grade > 25 && grade <= 50) {
        return "根据" + t + "上传的蚊子叮咬部位图片，结合当前症状和本地区传染病流行风险，尚不能排除感染蚊传疾病的风险。建议到医院就诊，做进一步诊断治疗。"
    } else if (grade > 50 && grade <= 75) {
        return "根据" + t + "上传的蚊子叮咬部位图片，结合当前症状和本地区传染病流行风险，尚不能排除感染蚊传疾病的风险。建议及时到医院就诊，做进一步诊断治疗。"
    } else if (grade > 75 && grade <= 100) {
        return "根据" + t + "上传的蚊子叮咬部位图片，结合当前症状和本地区传染病流行风险以及共同居住的家人已有XX发病，感染同样传染病的风险程度较高。建议立即到医院就诊，做进一步诊断治疗。"
    } else {
        return "根据2016-08-10 10:58:11上传的蚊子叮咬部位图片，结合本地区传染病流行风险，建议继续自我观察，如出现上述症状请再次评估。测试失败";
    }
}


AV.Cloud.define('get_grade', function (request, response) {
    // console.log('get_grade', JSON.stringify(request.params));10.8.11
    //diagnose(22.8155, 108.3275, '2016-09-26T14:25:44.388Z',['123'], '123')
    console.log(request.params);
    // TODO modify this
    var user_id = request.params.user_id || "57ed237eda2f60004f488d7e";
    var query = new AV.Query('CameraPosition');
    query.equalTo('user', AV.Object.createWithoutData('_User', user_id));
    query.descending('createdAt');
    query.find().then(function (results) {
        var lastPictureAt = new Date();
        if (results.length > 0) {
            lastPictureAt = results[0].get('createdAt');
        }
        var symptoms = request.params.symptoms || [];
        var family_disease = request.params.family_disease || [];

        console.log('lastPictureAt,' + lastPictureAt);
        diagnose(request.params.lat, request.params.lon, request.params.time,
            symptoms, family_disease, lastPictureAt)
            .then(function (result) {
                var suggestion = getSuggestion(result, symptoms, family_disease, lastPictureAt);
                console.log('su' + suggestion);
                response.success({
                    risk_rate: result,
                    last_pictured_at: results[0].get('createdAt'),
                    suggestion: suggestion
                });
            }, function (err) {
                response.error(err);
            })
    }, function (err) {
        response.error(err);
    })
});

function changeCoordinate(lon, lat, original, target) {
    return new Promise(function (fulfill, reject) {
        if (original == 'bd09' && target == 'wgs84') {
            console.log('3')
            var coord = coordtransform.bd09togcj02(lon, lat);//百度经纬度坐标转国测局坐标
            var target_coordinate = coordtransform.gcj02towgs84(coord[0], coord[1]);//国测局坐标转wgs84坐标
            console.log(target_coordinate)
        }
        else if (original == 'wgs84' && target == 'bd09') {
            console.log('4')
            var coord = coordtransform.wgs84togcj02(lon, lat);//wgs84转国测局坐标
            var target_coordinate = coordtransform.gcj02tobd09(coord[0], coord[1]);//国测局坐标转百度坐标
        }
        else {
            var originaltarget = original + 'to' + target
            var target_coordinate = coordtransform[originaltarget](lon, lat);
        }
        fulfill(target_coordinate);
    })
}

AV.Cloud.define('transformation_coordinate', function (request, response) {
    var lat = 38.00541012868753,
        lon = 114.51368950957637,
        original = 'gcj02',
        target = 'wgs84';
    changeCoordinate(lon, lat, original, target).then(function (result) {
        response.success(result);
    }, function (error) {
        response.success(error)
    });
});

AV.Cloud.afterSave('CameraPosition', function (request, response) {
    var query = new AV.Query('NumberOfPeople');
    query.get('57baaba7165abd006624d642').then(function (data) {
        var num = data.attributes.number;
        var update = AV.Object.createWithoutData('NumberOfPeople', '57baaba7165abd006624d642');
        update.set('number', num + 1);
        update.save();
    }, function (error) {
        alert('错误')
    });
});

//AV.Cloud.define('get_vaid_provinces', function (request, response) {
//    var querys = new AV.Query('VaidProvinces');
//    querys.equalTo('provinces_name', '上海市');
//    querys.find().then(function (results) {
//        var p = results;
//        console.log( (p[0].attributes.insects[12]))
//        response.success(p)
//    }, function (error) {
//
//    });
//});10.8.11.32

module.exports = AV.Cloud;
